var IMAGE_URL="images/";

var senderCity=[new Object(),new Object()];
var topSender=[new Object(),new Object()];
var markedLineData=[new Object(),new Object()];
var markedLineTopData=[new Object(),new Object()];
var markedPointData=[new Object(),new Object()];
var photoList=['0009','0012','0013','0029','0044','0060','0067','0069','0079','0083','0085','0096','0097','0102','0108','0111','0112','0116','0126','0135','0142','0154','0159','0171','0186','0212','0213','0220','0306','0309','0310','0315','0317','0331','0337','0351','0359','0385','0390','0396','0409','0441','0445','0471','0480','0484','0489','0571','0576','0594','0596','0600','0606','0610','0646','0660','0683','0701'];

//Map Data
function getData(callback){
    senderCity[0]=[{"name":"上海","value":324},{"name":"广州","value":214},{"name":"天津","value":73},{"name":"北京","value":13},{"name":"西安","value":12},{"name":"陕西","value":10},{"name":"广东","value":9},{"name":"顺德","value":9},{"name":"泽普","value":8},{"name":"杭州","value":8},{"name":"武汉","value":7},{"name":"重庆","value":7},{"name":"成都","value":6},{"name":"哈尔滨","value":6},{"name":"南京","value":6},{"name":"章丘","value":6},{"name":"舟山","value":5},{"name":"大连","value":4},{"name":"合肥","value":4},{"name":"沈阳","value":3},{"name":"厦门","value":3},{"name":"四川双流","value":3},{"name":"长沙","value":3},{"name":"拉萨","value":3},{"name":"香港","value":3},{"name":"珠海","value":3},{"name":"都江堰","value":3},{"name":"垦丁","value":2},{"name":"辽宁","value":2},{"name":"漠河","value":2},{"name":"长春","value":2},{"name":"东莞","value":2},{"name":"福建","value":2},{"name":"山东","value":2},{"name":"青海","value":1},{"name":"浙江","value":1},{"name":"昆明","value":1},{"name":"安徽","value":1},{"name":"富阳","value":1},{"name":"贵阳","value":1},{"name":"湖北","value":1},{"name":"大理","value":1},{"name":"四川","value":1},{"name":"漳州","value":1},{"name":"济南","value":1},{"name":"保定","value":1},{"name":"青岛","value":1},{"name":"柳州","value":1},{"name":"苏州","value":1},{"name":"北京大兴","value":1},{"name":"日喀则","value":1},{"name":"江苏","value":1},{"name":"兰州","value":1},{"name":"海口","value":1}];
    topSender[0]=senderCity[0].slice(0,5);
    senderCity[1]=[{"name":"摩洛哥","value":3},{"name":"英国格拉斯哥","value":2},{"name":"英国爱丁堡","value":2},{"name":"美国芝加哥","value":1},{"name":"荷兰阿姆斯特丹","value":1},{"name":"荷兰莱顿","value":1},{"name":"科罗拉多（Boulder Colorado）","value":1},{"name":"洛杉矶","value":1},{"name":"伯明翰","value":1},{"name":"弗罗里达（Florida）","value":1},{"name":"美国加州","value":1},{"name":"美国伊利诺伊州","value":1},{"name":"英国伯明翰","value":1},{"name":"韩国首尔","value":1},{"name":"德国萨克森","value":0}];
    senderCity[1]=senderCity[0].concat(senderCity[1]);
    topSender[1]=senderCity[1].slice(0,5);
    markedPointData[0]=[{"name":"广州","value":188},{"name":"上海复旦大学","value":111},{"name":"天津","value":46},{"name":"甘肃东风航天城","value":16},{"name":"上海外滩 陆家嘴","value":12},{"name":"西安西安建筑科技大学","value":9},{"name":"厦门鼓浪屿       ","value":8},{"name":"成都","value":6},{"name":"上海久牵","value":6},{"name":"陕西西北政法大学","value":5},{"name":"杭州西湖","value":5},{"name":"上海南京路","value":5},{"name":"杭州浙江大学","value":5},{"name":"珠海中山大学珠海校区","value":5},{"name":"桐乡乌镇","value":5},{"name":"广州黄埔港       ","value":4},{"name":"嘉善西塘","value":4},{"name":"舟山老街","value":4},{"name":"西安","value":3},{"name":"广州南越国博物馆","value":3},{"name":"南京鸡鸣寺","value":3},{"name":"南京乌衣巷","value":3},{"name":"苏州苏州大学","value":3},{"name":"广州华南农业大学","value":3},{"name":"武汉武汉大学","value":3},{"name":"上海上海交通大学","value":3},{"name":"厦门厦门大学","value":3},{"name":"东莞东莞理工学院城市学院","value":3},{"name":"山东泰山","value":3},{"name":"武汉黄鹤楼","value":2},{"name":"天津鼓楼","value":2},{"name":"苏州苏州平江路","value":2},{"name":"重庆解放碑","value":2},{"name":"天津津门津塔","value":2},{"name":"江苏同里","value":2},{"name":"上海城隍庙","value":2},{"name":"镇江昭关石塔","value":2},{"name":"吉林吉林大学","value":2},{"name":"北京长城","value":2},{"name":"上海中国馆","value":2},{"name":"重庆嘉陵江","value":2},{"name":"重庆洪崖洞","value":2},{"name":"上海复旦江湾校区","value":2},{"name":"上海西佘山国家森林公园","value":2},{"name":"上海华东理工大学","value":2},{"name":"花莲七星潭","value":2},{"name":"北京八达岭长城","value":2},{"name":"青岛中国石油大学","value":2},{"name":"北京北京大学","value":2},{"name":"上海华东师范大学","value":2},{"name":"青岛","value":2},{"name":"天津津湾广场","value":2},{"name":"珠海暨南大学","value":2},{"name":"厦门厦门湖里山炮台","value":2},{"name":"章丘山东财经大学明水校区","value":2},{"name":"南京秦淮河","value":2},{"name":"江苏南京总统府","value":2},{"name":"西藏大昭寺","value":2},{"name":"吉林延边长白山","value":2},{"name":"天津海河游船码头","value":1},{"name":"上海东方明珠","value":1},{"name":"无锡惠山古镇","value":1},{"name":"南京忆金陵","value":1},{"name":"南京东苑石船","value":1},{"name":"无锡灵山","value":1},{"name":"黑龙江漠河北极村","value":1},{"name":"香港太平山顶俯瞰","value":1},{"name":"澳门旅游塔与西湾大桥","value":1},{"name":"黑龙江雪乡","value":1},{"name":"四川南江峡谷溶洞","value":1},{"name":"北京鸟巢","value":1},{"name":"南京南京门楼","value":1},{"name":"上海华东政法大学","value":1},{"name":"上海上海夜色","value":1},{"name":"重庆长江索道","value":1},{"name":"香港会议展览中心","value":1},{"name":"香港青马大桥","value":1},{"name":"香港星光大道","value":1},{"name":"成都戏园子","value":1},{"name":"天津南开大学","value":1},{"name":"南京总统府","value":1},{"name":"北京颐和园","value":1},{"name":"南京地铁昆曲","value":1},{"name":"丽江丽江古城","value":1},{"name":"广州黄埔古港","value":1},{"name":"珠海珠海渔女","value":1},{"name":"珠海湾仔澳门街","value":1},{"name":"兰州兰州大学","value":1},{"name":"北京八达岭长城","value":1},{"name":"上海高架","value":1},{"name":"北京789艺术街区","value":1},{"name":"北京南锣鼓巷","value":1},{"name":"顺德乐从镇家具城","value":1},{"name":"顺德顺德区钟楼公园","value":1},{"name":"四川九寨沟树正瀑布","value":1},{"name":"四川九寨沟诺日朗瀑布","value":1},{"name":"四川黄龙","value":1},{"name":"四川九寨沟孔雀海","value":1},{"name":"四川九寨沟孔雀河","value":1},{"name":"四川九寨沟珍珠滩","value":1},{"name":"日喀则","value":1},{"name":"宜春宜春剑匣亭","value":1},{"name":"西藏喜马拉雅山脉","value":1},{"name":"南京南京师范大学","value":1},{"name":"北京水立方","value":1},{"name":"大理大理白族民居","value":1},{"name":"宁波宁波招宝山","value":1},{"name":"天津海河夜色","value":1},{"name":"天津西开教堂","value":1},{"name":"江苏无锡太湖","value":1},{"name":"辽宁虎山长城","value":1},{"name":"上海中国馆","value":1},{"name":"南京总统府","value":1},{"name":"上海黄浦江","value":1},{"name":"重庆朝天门码头","value":1},{"name":"重庆重庆夜景","value":1},{"name":"重庆老屋索道","value":1},{"name":"上海上海街头","value":1},{"name":"广州国立中山大学牌坊","value":1},{"name":"青岛青岛康有为故居","value":1},{"name":"南京南京大学      ","value":1},{"name":"广州华南农业大学校园","value":1},{"name":"北京颐和园东宫门","value":1},{"name":"湖南张家界","value":1},{"name":"浙江钱塘江","value":1},{"name":"上海新天地","value":1},{"name":"贵州滴水滩瀑布","value":1},{"name":"新疆火焰山","value":1},{"name":"天津海河","value":1},{"name":"台湾阿里山高山火车","value":1},{"name":"西藏藏彝走廊","value":1},{"name":"山东江苏路基督教堂","value":1},{"name":"丽江丽江老君山","value":1},{"name":"台湾台湾九份","value":1},{"name":"拉萨拉萨大昭寺","value":1},{"name":"上海同济大学校门","value":1},{"name":"苏州苏州园林","value":1},{"name":"上海华东政法大学","value":1},{"name":"甘肃马踏飞燕","value":1},{"name":"上海新天地石库门","value":1},{"name":"上海豫园","value":1},{"name":"广州中山大学","value":1},{"name":"上海","value":1},{"name":"福州福州大学","value":1},{"name":"青海果洛年宝玉则神山圣湖","value":1},{"name":"北京对外经贸大学","value":1},{"name":"北京对外经济贸易大学书途循环书店","value":1},{"name":"广州华南师范大学校园","value":1},{"name":"西安西安建筑科技大学工科楼","value":1},{"name":"丽江丽江宝山石头城   ","value":1},{"name":"上海田子坊       ","value":1},{"name":"台湾新北市       ","value":1},{"name":"北京中国农业大学    ","value":1},{"name":"上海华东师范大学理科大楼","value":1},{"name":"台湾高雄港       ","value":1},{"name":"无锡惠山古镇露天的历史博物馆","value":1},{"name":"湖北华中师范大学","value":1},{"name":"广州广州大学城","value":1},{"name":"武汉武汉大学老行政楼","value":1},{"name":"上海世界公园","value":1},{"name":"浙江千岛湖","value":1},{"name":"青岛青岛奥帆中心","value":1},{"name":"青岛青岛八大关","value":1},{"name":"北京清华大学","value":1},{"name":"湖南","value":1},{"name":"北京798艺术区","value":1},{"name":"上海老校门","value":1},{"name":"江西庐山","value":1},{"name":"广州华南师范大学图书馆","value":1},{"name":"青岛青岛德式监狱旧址博物馆","value":1},{"name":"重庆磁器口古镇","value":1}];
    markedPointData[1]=[{"name":"新加坡Marina Bay等","value":4},{"name":"法国埃菲尔铁塔","value":4},{"name":"英国伦敦塔桥","value":2},{"name":"美国黄石公园","value":2},{"name":"美国自由女神像","value":2},{"name":"希腊爱琴海","value":2},{"name":"美国金门大桥","value":2},{"name":"美国白宫","value":2},{"name":"墨西哥墨西哥城","value":2},{"name":"泰国普吉岛","value":2},{"name":"西班牙巴塞罗那","value":2},{"name":"土耳其伊斯坦布尔","value":2},{"name":"悉尼悉尼歌剧院","value":2},{"name":"意大利威尼斯","value":2},{"name":"纽约纽约","value":2},{"name":"英国爱丁堡","value":2},{"name":"美国芝加哥橡树街海滩","value":2},{"name":"摩洛哥","value":2},{"name":"摩洛哥","value":2},{"name":"荷兰阿姆斯特丹","value":2},{"name":"摩洛哥","value":2},{"name":"英国格拉斯哥大学","value":2},{"name":"韩国首尔南山塔","value":2},{"name":"泰国清莱","value":1},{"name":"荷兰莱顿大学","value":1},{"name":"德国萨克森州布伦瑞克","value":1},{"name":"巴黎巴黎街头","value":1},{"name":"瑞典圣诞","value":1},{"name":"巴塞罗那米拉之家","value":1},{"name":"科罗拉多州（Boulder Colorado）科罗拉多大学","value":1},{"name":"加利福尼亚州赫斯特城堡（Hearst Castle）","value":1},{"name":"伯明翰吉百利巧克力工厂","value":1},{"name":"日本          ","value":1},{"name":"土耳其卡帕多西亚","value":1},{"name":"澳大利亚悉尼","value":1},{"name":"埃及金字塔","value":1},{"name":"沙特阿拉伯迪拜帆船酒店","value":1},{"name":"意大利古罗马竞技场","value":1},{"name":"巴西里约热内卢","value":1},{"name":"英国大本钟","value":1},{"name":"捷克布拉格","value":1},{"name":"德国新天鹅堡","value":1},{"name":"英国利物浦","value":1},{"name":"美国纽约华尔街","value":1},{"name":"美国阿拉斯加","value":1},{"name":"美国波士顿","value":1},{"name":"美国西雅图","value":1},{"name":"美国加利福尼亚","value":1},{"name":"日本樱花","value":1},{"name":"伦敦泰晤士河","value":1},{"name":"西班牙巴塞罗那海滩","value":1},{"name":"印度印度泰姬陵","value":1},{"name":"美国加州大学圣克鲁斯分校","value":1},{"name":"美国伊利诺伊大学香槟分校","value":1},{"name":"英国伯明翰大学","value":1},{"name":"澳大利亚大堡礁","value":1},{"name":"英国威斯敏斯特宫","value":1},{"name":"罗马古希腊斗兽场","value":1},{"name":"埃及金字塔","value":1},{"name":"法国卢浮宫","value":1},{"name":"弗罗里达州（Florida）迪士尼乐园","value":1},{"name":"清迈清迈水灯节","value":1}];
    markedPointData[1]=markedPointData[0].concat(markedPointData[1]);
    var GEORECORD='{"拜城":[81.901235,42.045285],"广东":[113.394818,23.408004],"上海":[121.487899,31.249162],"南京南京大学      ":[118.778074,32.057236],"广州黄埔港       ":[113.469247,23.097088],"昆明":[102.714601,25.049153],"丽江丽江宝山石头城   ":[100.437432,27.476267],"上海田子坊       ":[121.475839,31.213897],"安徽":[117.216005,31.859252],"台湾新北市       ":[121.445833,25.011111],"厦门鼓浪屿       ":[118.073672,24.45234],"北京":[116.395645,39.929986],"北京中国农业大学    ":[116.395645,39.929986],"浙江":[119.957202,29.159494],"日本          ":[139.73333333333,35.683333333333],"上海华东师范大学理科大楼":[121.487899,31.249162],"台湾高雄港       ":[120.283333,22.616667],"无锡惠山古镇露天的历史博物馆":[120.215294,31.656376],"拉萨":[89.137982,31.367315],"土耳其卡帕多西亚":[28.966666666667,41.033333333333],"东莞":[113.763434,23.043024],"东莞东莞理工学院城市学院":[113.763434,23.043024],"广州中山大学":[113.304352,23.103199],"上海":[121.487899,31.249162],"福建":[117.984943,26.050118],"福州福州大学":[117.984943,26.050118],"青海":[96.202544,35.499761],"青海果洛年宝玉则神山圣湖":[100.223723,34.480485],"甘肃东风航天城":[104.114129,37.550339],"北京对外经贸大学":[116.395645,39.929986],"天津":[117.210813,39.14393],"成都":[104.040899,30.459478],"北京对外经济贸易大学书途循环书店":[116.395645,39.929986],"广州":[113.30765,23.120049],"广州华南师范大学校园":[113.30765,23.120049],"陕西":[109.503789,35.860026],"西安西安建筑科技大学工科楼":[108.976487,34.24177],"杭州西湖":[116.332733,30.319244],"北京清华大学":[116.395645,39.929986],"长沙":[112.979353,28.213478],"湖南":[112.979353,28.213478],"北京798艺术区":[116.395645,39.929986],"上海老校门":[121.487899,31.249162],"江西庐山":[116.009736,29.666586],"广州华南师范大学图书馆":[113.30765,23.120049],"大连":[121.593478,38.9487],"青岛青岛德式监狱旧址博物馆":[120.479529,36.107917],"重庆":[106.530635,29.544606],"重庆磁器口古镇":[116.424866,39.898771],"重庆解放碑":[106.530635,29.544606],"重庆朝天门码头":[106.530635,29.544606],"重庆重庆夜景":[106.530635,29.544606],"重庆老屋索道":[106.530635,29.544606],"珠海中山大学珠海校区":[113.593538,22.355192],"山东":[118.527663,36.09929],"青岛青岛康有为故居":[120.384428,36.105215],"上海南京路":[121.487899,31.249162],"武汉":[114.3162,30.581084],"湖北华中师范大学":[114.3162,30.581084],"广州广州大学城":[113.30765,23.120049],"湖北":[112.410562,31.209316],"武汉武汉大学老行政楼":[112.410562,31.209316],"上海世界公园":[121.487899,31.249162],"浙江千岛湖":[120.281114,30.165603],"都江堰":[103.637342,31.039124],"哈尔滨":[126.657717,45.773225],"青岛青岛奥帆中心":[120.384428,36.105215],"青岛青岛八大关":[120.384428,36.105215],"辽宁":[122.753592,41.6216],"山东泰山":[117.183902,36.215457],"澳大利亚悉尼":[150.88333333333,-33.916666666667],"埃及金字塔":[31.283333333333,30],"沙特阿拉伯迪拜帆船酒店":[55.283333333333,25.216666666667],"意大利古罗马竞技场":[12.61666666666,41.866666666667],"巴西里约热内卢":[-43.2,-22.9],"新疆火焰山":[89.181595,42.96047],"天津海河":[117.210813,39.14393],"台湾阿里山高山火车":[120.8,23.516667],"西藏藏彝走廊":[89.137982,31.367315],"新加坡Marina Bay等":[103.75,1.3666666666667],"山东江苏路基督教堂":[116.237276,40.22939],"丽江丽江老君山":[101.35407,26.81398],"台湾台湾九份":[121.843,25.107],"杭州":[120.219375,30.259244],"杭州浙江大学":[120.219375,30.259244],"拉萨拉萨大昭寺":[89.137982,31.367315],"上海同济大学校门":[121.487899,31.249162],"苏州苏州园林":[120.619907,31.317987],"上海华东政法大学":[121.487899,31.249165],"甘肃马踏飞燕":[102.457625,38.103267],"上海新天地石库门":[121.487899,31.249167],"上海豫园":[121.487899,31.249167],"苏州苏州平江路":[120.619907,31.317987],"上海上海街头":[121.487899,31.249167],"广州国立中山大学牌坊":[113.30765,23.120051],"武汉黄鹤楼":[114.3162,30.581084],"广州华南农业大学校园":[113.30765,23.120051],"北京颐和园东宫门":[116.395645,39.929986],"桐乡乌镇":[119.957202,29.159494],"英国大本钟":[-0.13796666666667,51.499227777778],"湖南张家界":[110.48162,29.124889],"浙江钱塘江":[119.957202,29.159494],"上海新天地":[121.487899,31.249173],"富阳":[119.846692,30.001094],"贵阳":[106.709177,26.629907],"贵州滴水滩瀑布":[105.622101,25.98252],"天津鼓楼":[117.210813,39.14394],"捷克布拉格":[14.437777777778,50.078888888889],"西安":[108.953098,34.2778],"陕西西北政法大学":[108.953098,34.2778],"漠河":[122.715721,52.945659],"黑龙江雪乡":[128.047414,47.356592],"德国新天鹅堡":[10.733333333333,47.583333333333],"英国利物浦":[-2.9777777777778,53.410555555556],"四川南江峡谷溶洞":[106.836181,32.337239],"北京鸟巢":[116.395645,39.929986],"美国纽约华尔街":[-74,40.716666666667],"美国阿拉斯加":[-86.633333333333,39.466666666667],"美国波士顿":[-71.083333333333,42.316666666667],"美国西雅图":[-122.03333333333,47.633333333333],"美国加利福尼亚":[-118.25,34.05],"南京南京门楼":[118.778074,32.057236],"上海华东政法大学":[121.487899,31.249186],"日本樱花":[139.73333333333,35.683333333333],"伦敦泰晤士河":[0.0019444444444444,51.5],"西班牙巴塞罗那海滩":[2.1,41.3],"印度印度泰姬陵":[72.033333333333,17.166666666667],"悉尼悉尼歌剧院":[150.88333333333,-33.916666666667],"上海上海夜色":[121.487899,31.249193],"瑞典圣诞":[18.05,59.316666666667],"巴塞罗那米拉之家":[2.1,41.3],"重庆长江索道":[106.530635,29.544606],"天津":[117.210813,39.14393],"无锡灵山":[120.111583,31.444409],"黑龙江漠河北极村":[122.361877,53.467018],"长春":[125.313642,43.898338],"香港太平山顶俯瞰":[114.159777,22.287867],"澳门旅游塔与西湾大桥":[113.550756,22.169844],"天津津湾广场":[117.2141,39.138216],"天津海河游船码头":[117.210813,39.14393],"上海东方明珠":[121.507137,31.24475],"无锡惠山古镇":[120.281774,31.587869],"南京忆金陵":[118.778074,32.057236],"南京":[118.778074,32.057236],"南京东苑石船":[118.778074,32.057236],"江苏同里":[116.460997,39.941875],"四川":[102.89916,30.367481],"厦门厦门大学":[118.100797,24.444409],"天津津门津塔":[117.210813,39.14393],"天津海河夜色":[117.2141,39.138216],"天津西开教堂":[117.200767,39.124134],"江苏无锡太湖":[120.305456,31.570037],"辽宁虎山长城":[124.528379,40.232818],"上海中国馆":[121.501316,31.189248],"南京总统府":[118.803852,32.049057],"上海黄浦江":[121.487899,31.249162],"西安西安建筑科技大学":[108.974375,34.241747],"西藏喜马拉雅山脉":[89.137982,31.367315],"南京南京师范大学":[118.777981,32.06016],"漳州":[117.676205,24.517065],"北京水立方":[116.396699,39.999319],"大理大理白族民居":[100.114633,25.900321],"舟山":[122.169872,30.03601],"宁波宁波招宝山":[121.721924,29.957383],"上海城隍庙":[121.487899,31.249162],"上海复旦大学":[121.507065,31.296281],"上海久牵":[121.487899,31.249162],"香港":[114.186124,22.293586],"香港会议展览中心":[114.186124,22.293586],"香港青马大桥":[114.186124,22.293586],"香港星光大道":[114.186124,22.293586],"科罗拉多（Boulder Colorado）":[-105.07805555556,40.559166666667],"科罗拉多州（Boulder Colorado）科罗拉多大学":[-120.79972222222,40.559166666667],"洛杉矶":[-118.36666666667,34.083333333333],"加利福尼亚州赫斯特城堡（Hearst Castle）":[-118.36666666667,34.083333333333],"伯明翰":[-1.8936111111111,52.483055555556],"伯明翰吉百利巧克力工厂":[-1.8936111111111,52.483055555556],"珠海":[113.562447,22.256915],"成都戏园子":[104.067923,30.679943],"天津南开大学":[117.210813,39.14393],"章丘":[117.479345,36.744883],"南京总统府":[118.778074,32.057236],"北京颐和园":[116.276886,39.999498],"南京地铁昆曲":[118.778074,32.057236],"大理":[100.219209,25.693967],"丽江丽江古城":[100.229628,26.875351],"垦丁":[120.79972222222,21.949722222222],"广州黄埔古港":[113.30765,23.120049],"合肥":[117.282699,31.866942],"珠海珠海渔女":[113.562447,22.256915],"珠海湾仔澳门街":[113.562447,22.256915],"兰州":[103.823305,36.064226],"兰州兰州大学":[103.823305,36.064226],"北京八达岭长城":[115.983509,40.367837],"泽普":[77.226408,38.122553],"上海高架":[121.487899,31.249162],"英国伦敦塔桥":[-0.1275,51.506944444444],"澳大利亚大堡礁":[147.7,-18.286111111111],"北京789艺术街区":[116.395645,39.929986],"北京南锣鼓巷":[116.409536,39.945486],"英国威斯敏斯特宫":[-0.1275,51.506944444444],"顺德":[113.18703,22.84851],"顺德乐从镇家具城":[113.18703,22.84851],"顺德顺德区钟楼公园":[113.18703,22.84851],"四川九寨沟树正瀑布":[103.934044,33.317446],"四川九寨沟诺日朗瀑布":[103.934044,33.317446],"四川黄龙":[106.063379,31.089408],"四川九寨沟孔雀海":[103.934044,33.317446],"四川九寨沟孔雀河":[103.934044,33.317446],"四川九寨沟珍珠滩":[103.934044,33.317446],"海口":[110.330802,20.022071],"罗马古希腊斗兽场":[12.616666666667,41.866666666667],"埃及金字塔":[31,7.4994444],"厦门":[118.100797,24.444409],"法国埃菲尔铁塔":[2.294575,48.858266666667],"法国卢浮宫":[2.3366777777778,48.860838888889],"弗罗里达（Florida）":[-81.313055555556,29.894166666667],"弗罗里达州（Florida）迪士尼乐园":[-81.313208,29.894444],"清迈清迈水灯节":[98.983333333333,18.788888888889],"江苏":[119.368489,33.013797],"镇江昭关石塔":[119.437135,32.221115],"四川双流":[104.040899,30.459478],"济南":[117.024967,36.682785],"意大利威尼斯":[12.335833,45.4375],"吉林吉林大学":[125.313642,43.898338],"北京长城":[116.395645,39.929986],"保定":[115.49481,38.886565],"武汉武汉大学":[114.369247,30.544068],"青岛":[120.384428,36.105215],"青岛中国石油大学":[118.552724,37.473054],"柳州":[109.422402,24.329053],"北京北京大学":[116.395645,39.929986],"上海华东师范大学":[121.487899,31.249162],"宜春宜春剑匣亭":[114.400039,27.81113],"章丘山东财经大学明水校区":[125.841268,47.201247],"嘉善西塘":[119.957202,29.159494],"苏州":[120.619907,31.317987],"苏州苏州大学":[120.619907,31.317987],"纽约纽约":[-73.94,40.67],"北京大兴":[116.395645,39.929986],"巴黎巴黎街头":[2.3508,48.8567],"日喀则":[88.956063,29.26816],"日喀则":[88.956063,29.26816],"成都":[104.067923,30.679943],"沈阳":[123.432791,41.808645],"广州华南农业大学":[113.30765,23.120049],"青岛":[120.384428,36.105215],"舟山老街":[122.169872,30.03601],"吉林延边长白山":[128.183994,42.190956],"西安":[115.875687,39.765709],"广州南越国博物馆":[113.284465,23.130133],"西藏大昭寺":[91.140363,29.656058],"上海外滩 陆家嘴":[121.487899,31.249162],"上海上海交通大学":[121.487899,31.249162],"上海中国馆":[121.487899,31.249162],"重庆嘉陵江":[106.530635,29.544606],"重庆洪崖洞":[106.584386,29.568066],"美国黄石公园":[-110.5,44.6],"美国自由女神像":[-74.044444,40.689167],"希腊爱琴海":[24.9525,39.259444],"美国金门大桥":[-122.478611,37.819444],"美国白宫":[-77.036389,38.896667],"上海复旦江湾校区":[121.487899,31.249162],"墨西哥墨西哥城":[-99.133333,19.433333],"上海西佘山国家森林公园":[121.487899,31.249162],"上海华东理工大学":[121.487899,31.249162],"花莲七星潭":[120.979361,23.972583],"泰国普吉岛":[98.333333,7.966667],"西班牙巴塞罗那":[2.183333,41.383333],"北京八达岭长城":[116.395645,39.929986],"土耳其伊斯坦布尔":[28.966667,41.016667],"广州":[113.30765,23.120049],"美国加州":[-118.25,34.05],"美国加州大学圣克鲁斯分校":[-118.25,34.05],"美国伊利诺伊州":[-88.228411,40.110539],"美国伊利诺伊大学香槟分校":[-88.228411,40.110539],"英国伯明翰":[-1.893611,52.483056],"英国伯明翰大学":[-1.893611,52.483056],"英国爱丁堡":[-3.188889,55.953056],"英国爱丁堡":[-3.188889,55.953056],"德国萨克森":[10.516667,52.266667],"德国萨克森州布伦瑞克":[10.516667,52.266667],"美国芝加哥":[-87.627778,41.881944],"美国芝加哥橡树街海滩":[-87.627778,41.881944],"荷兰阿姆斯特丹":[4.897,52.371],"荷兰莱顿":[4.897,52.371],"荷兰莱顿大学":[4.897,52.371],"摩洛哥":[-7.583333,33.533333],"摩洛哥":[-7.583333,33.533333],"摩洛哥":[-7.583333,33.533333],"英国格拉斯哥":[-4.259,55.858],"江苏南京总统府":[118.803852,32.049057],"泰国清莱":[99.826944,19.913611],"荷兰阿姆斯特丹":[4.897,52.371],"摩洛哥":[-7.583333,33.533333],"南京鸡鸣寺":[118.778074,32.057236],"南京秦淮河":[118.778074,32.057236],"南京乌衣巷":[118.778074,32.057236],"英国格拉斯哥大学":[-4.259,55.858],"珠海暨南大学":[113.542057,22.256857],"厦门厦门湖里山炮台":[118.103886,24.489231],"韩国首尔":[126.98955,37.5651],"韩国首尔南山塔":[126.988227,37.551169]}';
    option.series[0].geoCoord= eval('(' + GEORECORD + ')');
    markedLineData[0]=eval('(' + markLineToString(senderCity[0]) + ')');
    markedLineData[1]=eval('(' + markLineToString(senderCity[1]) + ')');
    markedLineTopData[0]=eval('(' + markColorLineToString(topSender[0]) + ')');
    markedLineTopData[1]=eval('(' + markColorLineToString(topSender[1]) + ')');
    option.series[0].markLine.data=markedLineData[0];
    option.series[1].markLine.data=markedLineTopData[0];
    option.series[2].markPoint.data=markedPointData[0].concat(senderCity[0]);
    callback();
}

function switchMapMode(){
    MAPMODE=1-MAPMODE;
    
    if(MAPMODE==1){
        for(var i=0;i<option.series.length;i++){
            option.series[i].mapType='world';
        }
    }
    else{
        for(var i=0;i<option.series.length;i++){
            option.series[i].mapType='china';
        }
    }
    option.series[0].markLine.data=markedLineData[MAPMODE];
    option.series[1].markLine.data=markedLineTopData[MAPMODE];
    option.series[2].markPoint.data=markedPointData[MAPMODE].concat(senderCity[MAPMODE]);
    myChart=echarts.init(document.getElementById('map'));
    myChart.setOption(option);
}

function markLineToString(sender){
    var markLineStr='['
    for(var i=0;i<sender.length;i++){
        markLineStr=markLineStr+'[{name:\''+sender[i].name+'\'},{name:"拜城"}]';
        if(i==sender.length-1){
            markLineStr+=']';
        }
        else{
            markLineStr+=',';
        }
    }
    return markLineStr;
}

function markColorLineToString(sender){
    var markTopLineStr='[';
    for(var i=0;i<sender.length;i++){
        markTopLineStr=markTopLineStr+'[{name:\''+sender[i].name+'\'},{name:"拜城",value:'+sender[i].value+'}]';
        if(i==sender.length-1){
            markTopLineStr+=']';
        }
        else{
            markTopLineStr+=',';
        }
    }
    return markTopLineStr;
}

//Card Data
function getCardData(){
    for(var i=0;i<photoList.length;i++){
        $('#cardList').append('<li><img src="'+IMAGE_URL+photoList[i]+'正.jpg"></li>');
        $('#cardList').append('<li><img src="'+IMAGE_URL+photoList[i]+'反.jpg"></li>');
    }
    $('#cardList').append('<li><img src="'+IMAGE_URL+'0139.jpg"></li>');
    $('#cardList').append('<li><img src="'+IMAGE_URL+'0207.jpg"></li>');
}

//eChart Option
var effect = {
    show: true,
    scaleSize: 1,
    period: 15,             // 运动周期，无单位，值越大越慢
    color: '#fff',
    shadowColor: 'rgba(220,220,220,4)',
    shadowBlur : 1
};

var option = {
    backgroundColor: '#000',
    color: ['gold','aqua'],
    tooltip : {
        trigger: 'item',
        formatter: '{b}'
    },
    toolbox: {
        show : false,
        orient : 'vertical',
        x: 'right',
        y: 'top',
        feature : {
            saveAsImage : {show: true}
        }
    },
    dataRange: {
        show:false,
        min : 0,
        max : 30,
        calculable : true,
        color: ['aqua','aqua'],
        textStyle:{
            color:'#fff'
        }
    },
    series : [
        {
            name: '基础线',
            type: 'map',
            roam: true,
            hoverable: false,
            mapType: 'china',
            itemStyle:{
                normal:{
                    borderColor:'rgba(100,149,237,1)',
                    borderWidth:0.5,
                    areaStyle:{
                        color: '#000'
                    }
                }
            },
            data:[],
            markLine : {
                smooth:true,
                symbol: ['circle', 'circle'],  
                symbolSize : 1,
                itemStyle : {
                    normal: {
                        color:'#fff',
                        borderWidth:0.7,
                        borderColor:'rgba(30,144,255,0.5)'
                    }
                },
                data:[]
            },
            geoCoord:[] 
        },
        {
            name: '寄出地 Top10',
            type: 'map',
            mapType: 'china',
            data:[],
            markLine : {
                smooth:true,
                symbol: ['none', 'none'],
                effect : {
                    show: true,
                    scaleSize: 1,
                    period: 15,
                    color: '#fff',
                    shadowBlur: 2
                },
                itemStyle : {
                    normal: {
                        borderWidth:0.7,
                        lineStyle: {
                            type: 'solid',
                            shadowBlur: 10
                        }
                    }
                },
                data : []
            },
            markPoint : {
                symbol:'emptyCircle',
                symbolSize : function (v){
                    return 5 + v/300
                },
                effect : {
                    show: true,
                    shadowBlur : 0
                },
                itemStyle:{
                    normal:{
                        label:{show:false}
                    },
                    emphasis: {
                        label:{position:'top'}
                    }
                },
                data :[{name:'拜城',value:1461}]
            }
        },
        {
            name: '风景点',
            type: 'map',
            mapType: 'china',

            data : [],
            markPoint : {
                symbolSize: 2,
                large: true,
                effect : {
                    show: true,
                    period:10
                },
                data : []
            }
        }
    ]
};